print("Любите ли вы котиков?")
ans1 = input()
print("Умеете ли вы программировать?")
ans2 = input()
if ((ans1 != "да") and (ans1 != "да")) or ((ans2 != "да") and (ans2 != "да")):
    print("Ошибка при вводе ответа.")
    exit
if (ans1 == "да") and (ans2 == "да"):
    print("Вы обладаете незаурядным умом.")
if (ans1 == "да") and (ans2 == "нет"):
    print("Вы обладаете заурядным умом.")
if (ans1 == "нет") and (ans2 == "да"):
    print("Вы обладаете умом.")
if (ans1 == "нет") and (ans2 == "нет"):
    print("Вы не обладаете умом.")