Ур.28-2
1.	Для чего используются подпрограммы?
Подпрограммы используются для того чтобы сократить код программы , не писать одно и тоже несколько раз. Запись вспомогательных алгоритмов в языках программирования осуществляется с помощью подпрограмм. В Паскале различают два вида подпрограмм: процедуры и функции.
2.	В чем различие между процедурами и функциями?
Процедуры: могут выполнять некоторое действие или могут иметь несколько результатов, результатами могут быть значения любого типа, команда вызова процедуры – отдельная команда, которая употребляется самостоятельно.
Функции: имеет только один результат, результат может быть только типа integer, real или char, обращение к функции может использоваться только как компонент выражения соответствующего типа, должен быть хотя бы один оператор присваивания.
3.	Какие существуют способы передачи данных между подпрограммой и вызывающей её программой?
Существует два способа обмена данными между программой и подпрограммой: - использование глобальных переменных; - использование механизма формальных и фактических параметров. Первый способ является очевидным, ведь глобальные переменные являются доступными для всех подпрограмм, расположенных в тексте программы ниже объявления глобальных переменных.
4.	Составьте программу вычисления площади кольца по значениям внутреннего и внешнего радиусов, используя подпрограмму вычисления площади круга (два варианта: с процедурой и с функцией).
Program TaskA;
Var r1, r2: Integer;
Procedure S(r1, r2: Integer);
Var s: Real;
Begin
If r1 > r2 Then
s := Pi * (r1 * r1 - r2 * r2)
Else
s := Pi * (r2 * r2 - r1 * r1);
WriteLn('Площадь кольца: ', s:5:2);
End;
Begin
Write('r1 = ');
ReadLn(r1);
Write('r2 = ');
ReadLn(r2);
S(r1, r2);
ReadLn;
End.


Program TaskA;
Var r1, r2: Integer;
Function S(r1, r2: Integer): Real;
Begin
If r1 > r2 Then
result := Pi * (r1 * r1 - r2 * r2)
Else
result := Pi * (r2 * r2 - r1 * r1);
End;
Begin
Write('r1 = ');
ReadLn(r1);
Write('r2 = ');
ReadLn(r2);
WriteLn('Площадь кольца: ', S(r1, r2):5:2);
end.
